programming/devops/chef.org
#+SETUPFILE: ../../styles/readtheorg.setup
#+TITLE: Chef

* Chef
** ChefDK

[[https://docs.chef.io/about_chefdk.html][Chef Docs | About ChefDK]]

Chef Development Kit 用于在本地环境开发和测试架构代码，然后将代码发送至 Chef Server。

** Chef Server

Chef Server is the central repo of info and code to provision the nodes.

** Chef Client

Chef Client 运行在每台需要配置的节点上，执行配置以使节点达到理想状态（此过程称为 convergence）。Chef Client 不实时监控节点的状态，只在运行时才检查节点的状态并进行修改。

Chef Client 的默认模式为从 Chef Server 获取配置，可以使用本地模式，执行本地的配置。

** Embedded Ruby

Chef 安装时会同时安装一个嵌入式 Ruby 环境，独立于系统本身的 Ruby 环境。

#+BEGIN_SRC sh
chef exec # 在嵌入式 Ruby 环境中执行命令
chef gem  # 在嵌入式 Ruby 环境中执行 gem
#+END_SRC

* Feature
** Search

[[https://docs.chef.io/chef_search.html][Chef Docs | About Search]]

*** 索引

| =node=        |                              |
|---------------+------------------------------|
| =role=        |                              |
|---------------+------------------------------|
| =environment= |                              |
|---------------+------------------------------|
| =<data_bag>=  | 每个 data bag 使用单独的索引 |

*** 函数

可以在 recipe 中调用。

#+BEGIN_SRC ruby
search('<index>', '<query>')
#+END_SRC

#+BEGIN_SRC ruby
search('node', 'role:web').each do |web_node|
  ...
end
#+END_SRC

** Data Bag

[[https://docs.chef.io/data_bags.html][Chef Docs | About Data Bags]]

Data bag 是以 JSON 形式存储的全局变量，用于节点间共享的数据，如用户、组等。Data bag 数据被 Chef Server 索引，可以用于 cookbook 或搜索。

* Syntax
** Run-list

[[https://docs.chef.io/run_lists.html][Chef Docs | About Run-lists]]

#+BEGIN_SRC ruby
'recipe[<cookbook>::<recipe>]'
'recipe[<cookbook>]'           # 不指定 cookbook 则默认为 default cookbook
'role[<role>]'
#+END_SRC

** Versioning

[[https://docs.chef.io/cookbook_versioning.html][Chef Docs | About Cookbook Versioning]]

表示 cookbook 版本的语法，用于各种配置文件和命令行中。

| ~=~  | 等于                     |
|------+--------------------------|
| =>=  | 大于                     |
|------+--------------------------|
| =<=  | 小于                     |
|------+--------------------------|
| =>== | 大于等于，或 optimistic  |
|------+--------------------------|
| =<== | 小于等于                 |
|------+--------------------------|
| =~>= | 接近大于，或 pessimistic |

#+BEGIN_SRC ruby
~> 2.6   # 2.6 <= version < 3.0
~> 2.6.5 # 2.6.5 <= version < 2.7.0
#+END_SRC

* Resource

在 recipe 文件中，一个 resource 描述一个可配置项（如文件、包、服务）的理想状态。

| 文件系统 | =file=          |
|          | =remote_file=   |
|          | =cookbook_file= |
|          | =template=      |
|          | =directory=     |
|----------+-----------------|
| 系统     | =package=       |
|          | =service=       |
|----------+-----------------|
| 脚本     | =bash=          |
|          | =execute=       |
|----------+-----------------|
| 用户     | =user=          |
|          | =group=         |

