programming/devops/chef.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-16 Sun 19:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chef</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Victor Chen" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Chef</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2ea660e">1 Chef</a>
<ul>
<li><a href="#org48006e5">1.1 ChefDK</a></li>
<li><a href="#org3bb54a6">1.2 Chef Server</a></li>
<li><a href="#org08c466f">1.3 Chef Client</a></li>
<li><a href="#org2452a25">1.4 Embedded Ruby</a></li>
</ul>
</li>
<li><a href="#org3605111">2 Feature</a>
<ul>
<li><a href="#orge32150e">2.1 Search</a>
<ul>
<li><a href="#orgae568ad">2.1.1 索引</a></li>
<li><a href="#orgf55fdd2">2.1.2 函数</a></li>
</ul>
</li>
<li><a href="#orgf311bdb">2.2 Data Bag</a></li>
</ul>
</li>
<li><a href="#org1771cba">3 Syntax</a>
<ul>
<li><a href="#orgfdb04a7">3.1 Run-list</a></li>
<li><a href="#orgbb6ba10">3.2 Versioning</a></li>
</ul>
</li>
<li><a href="#orga59a686">4 Resource</a>
<ul>
<li><a href="#org5734e2c">4.1 Guards</a></li>
<li><a href="#org9a520c8">4.2 Notifications</a>
<ul>
<li><a href="#org6a5617b">4.2.1 <code>notifies</code></a></li>
<li><a href="#org088660e">4.2.2 <code>subscribes</code></a></li>
</ul>
</li>
<li><a href="#org17a6635">4.3 <code>bash</code></a></li>
<li><a href="#orge69ddac">4.4 <code>cookbook_file</code></a></li>
<li><a href="#orge02f57d">4.5 <code>directory</code></a></li>
<li><a href="#org91e57d1">4.6 <code>execute</code></a></li>
<li><a href="#org87a63ab">4.7 <code>file</code></a></li>
<li><a href="#orgf4202cd">4.8 <code>group</code></a></li>
<li><a href="#org3285ea1">4.9 <code>package</code></a></li>
<li><a href="#org5182fc1">4.10 <code>remote_file</code></a></li>
<li><a href="#orgfcc7814">4.11 <code>service</code></a></li>
<li><a href="#org965c71f">4.12 <code>template</code></a></li>
<li><a href="#org3f8778c">4.13 <code>user</code></a></li>
</ul>
</li>
<li><a href="#orgba61caa">5 Recipe</a>
<ul>
<li><a href="#org43da4a4">5.1 <code>include_recipe</code></a></li>
</ul>
</li>
<li><a href="#orge035cd7">6 Template</a></li>
<li><a href="#orga640d32">7 Cookbook</a>
<ul>
<li><a href="#org96e6fb2">7.1 <code>metadata.rb</code></a></li>
</ul>
</li>
<li><a href="#org3cf8bbd">8 Role</a>
<ul>
<li><a href="#orgeb9d7cb">8.1 配置</a></li>
</ul>
</li>
<li><a href="#orgda881fb">9 Environment</a>
<ul>
<li><a href="#org4cd8cfc">9.1 配置</a></li>
</ul>
</li>
<li><a href="#org9b19179">10 Ohai</a>
<ul>
<li><a href="#org8177ec6">10.1 <code>node</code></a></li>
</ul>
</li>
<li><a href="#orgb99ea2a">11 Test Kitchen</a></li>
<li><a href="#orgdb486aa">12 ChefSpec</a></li>
<li><a href="#org96756d2">13 Knife</a></li>
<li><a href="#org30e8fe2">14 Berkshelf</a>
<ul>
<li><a href="#org80271c9">14.1 配置</a></li>
<li><a href="#orgb4f2797">14.2 依赖</a></li>
</ul>
</li>
<li><a href="#org1848e8b">15 <code>chef</code></a>
<ul>
<li><a href="#org05c128e">15.1 <code>exec</code></a></li>
<li><a href="#org63b6cc2">15.2 <code>generate</code></a>
<ul>
<li><a href="#org7701fb8">15.2.1 <code>cookbook</code></a></li>
<li><a href="#org1d93561">15.2.2 <code>file</code></a></li>
<li><a href="#org703135b">15.2.3 <code>recipe</code></a></li>
<li><a href="#orgd99a49b">15.2.4 <code>template</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3a6b5ea">16 <code>chef-client</code></a></li>
<li><a href="#org4b47f94">17 <code>ohai</code></a></li>
<li><a href="#org7d15ff6">18 <code>kitchen</code></a></li>
<li><a href="#orgca6d2bc">19 <code>knife</code></a>
<ul>
<li><a href="#org745964b">19.1 <code>bootstrap</code></a></li>
<li><a href="#orgc4e73ee">19.2 <code>cookbook</code></a></li>
<li><a href="#org76020e5">19.3 <code>data bag</code></a></li>
<li><a href="#org34290f4">19.4 <code>environment</code></a></li>
<li><a href="#org815ba96">19.5 <code>node</code></a></li>
<li><a href="#org9f421ec">19.6 <code>role</code></a></li>
<li><a href="#org1b88ffc">19.7 <code>search</code></a></li>
<li><a href="#org0dcef30">19.8 <code>ssh</code></a></li>
<li><a href="#orgd701515">19.9 <code>vault</code></a></li>
</ul>
</li>
<li><a href="#org3d0e6cf">20 <code>berks</code></a>
<ul>
<li><a href="#org405c53e">20.1 <code>install</code></a></li>
<li><a href="#orgea7c24b">20.2 <code>upload</code></a></li>
</ul>
</li>
<li><a href="#org91b87d9">21 <code>cookstyle</code></a></li>
<li><a href="#orge778951">22 链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2ea660e" class="outline-2">
<h2 id="org2ea660e"><span class="section-number-2">1</span> Chef</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org48006e5" class="outline-3">
<h3 id="org48006e5"><span class="section-number-3">1.1</span> ChefDK</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://docs.chef.io/about_chefdk.html">Chef Docs | About ChefDK</a>
</p>

<p>
Chef Development Kit 用于在本地环境开发和测试架构代码，然后将代码发送至 Chef Server。
</p>
</div>
</div>

<div id="outline-container-org3bb54a6" class="outline-3">
<h3 id="org3bb54a6"><span class="section-number-3">1.2</span> Chef Server</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Chef Server is the central repo of info and code to provision the nodes.
</p>
</div>
</div>

<div id="outline-container-org08c466f" class="outline-3">
<h3 id="org08c466f"><span class="section-number-3">1.3</span> Chef Client</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Chef Client 运行在每台需要配置的节点上，执行配置以使节点达到理想状态（此过程称为 convergence）。Chef Client 不实时监控节点的状态，只在运行时才检查节点的状态并进行修改。
</p>

<p>
Chef Client 的默认模式为从 Chef Server 获取配置，可以使用本地模式，执行本地的配置。
</p>
</div>
</div>

<div id="outline-container-org2452a25" class="outline-3">
<h3 id="org2452a25"><span class="section-number-3">1.4</span> Embedded Ruby</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Chef 安装时会同时安装一个嵌入式 Ruby 环境，独立于系统本身的 Ruby 环境。
</p>

<div class="org-src-container">
<pre class="src src-sh">chef exec <span class="org-comment-delimiter"># </span><span class="org-comment">&#22312;&#23884;&#20837;&#24335; Ruby &#29615;&#22659;&#20013;&#25191;&#34892;&#21629;&#20196;</span>
chef gem  <span class="org-comment-delimiter"># </span><span class="org-comment">&#22312;&#23884;&#20837;&#24335; Ruby &#29615;&#22659;&#20013;&#25191;&#34892; gem</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3605111" class="outline-2">
<h2 id="org3605111"><span class="section-number-2">2</span> Feature</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orge32150e" class="outline-3">
<h3 id="orge32150e"><span class="section-number-3">2.1</span> Search</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://docs.chef.io/chef_search.html">Chef Docs | About Search</a>
</p>
</div>

<div id="outline-container-orgae568ad" class="outline-4">
<h4 id="orgae568ad"><span class="section-number-4">2.1.1</span> 索引</h4>
<div class="outline-text-4" id="text-2-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>node</code></th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>role</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>environment</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>&lt;data_bag&gt;</code></td>
<td class="org-left">每个 data bag 使用单独的索引</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf55fdd2" class="outline-4">
<h4 id="orgf55fdd2"><span class="section-number-4">2.1.2</span> 函数</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
可以在 recipe 中调用。
</p>

<div class="org-src-container">
<pre class="src src-ruby">search(<span class="org-string">'&lt;index&gt;'</span>, <span class="org-string">'&lt;query&gt;'</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby">search(<span class="org-string">'node'</span>, <span class="org-string">'role:web'</span>).each <span class="org-keyword">do</span> |web_node|
  ...
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf311bdb" class="outline-3">
<h3 id="orgf311bdb"><span class="section-number-3">2.2</span> Data Bag</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="https://docs.chef.io/data_bags.html">Chef Docs | About Data Bags</a>
</p>

<p>
Data bag 是以 JSON 形式存储的全局变量，用于节点间共享的数据，如用户、组等。Data bag 数据被 Chef Server 索引，可以用于 cookbook 或搜索。
</p>
</div>
</div>
</div>

<div id="outline-container-org1771cba" class="outline-2">
<h2 id="org1771cba"><span class="section-number-2">3</span> Syntax</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgfdb04a7" class="outline-3">
<h3 id="orgfdb04a7"><span class="section-number-3">3.1</span> Run-list</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<a href="https://docs.chef.io/run_lists.html">Chef Docs | About Run-lists</a>
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span class="org-string">'recipe[&lt;cookbook&gt;::&lt;recipe&gt;]'</span>
<span class="org-string">'recipe[&lt;cookbook&gt;]'</span>           <span class="org-comment-delimiter"># </span><span class="org-comment">&#19981;&#25351;&#23450; cookbook &#21017;&#40664;&#35748;&#20026; default cookbook</span>
<span class="org-string">'role[&lt;role&gt;]'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb6ba10" class="outline-3">
<h3 id="orgbb6ba10"><span class="section-number-3">3.2</span> Versioning</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<a href="https://docs.chef.io/cookbook_versioning.html">Chef Docs | About Cookbook Versioning</a>
</p>

<p>
表示 cookbook 版本的语法，用于各种配置文件和命令行中。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>=</code></th>
<th scope="col" class="org-left">等于</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>&gt;</code></td>
<td class="org-left">大于</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>&lt;</code></td>
<td class="org-left">小于</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>&gt;=</code></td>
<td class="org-left">大于等于，或 optimistic</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>&lt;=</code></td>
<td class="org-left">小于等于</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>~&gt;</code></td>
<td class="org-left">接近大于，或 pessimistic</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-ruby">~&gt; 2.6   <span class="org-comment-delimiter"># </span><span class="org-comment">2.6 &lt;= version &lt; 3.0</span>
~&gt; 2.6.5 <span class="org-comment-delimiter"># </span><span class="org-comment">2.6.5 &lt;= version &lt; 2.7.0</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga59a686" class="outline-2">
<h2 id="orga59a686"><span class="section-number-2">4</span> Resource</h2>
<div class="outline-text-2" id="text-4">
<p>
在 recipe 文件中，一个 resource 描述一个可配置项（如文件、包、服务）的理想状态。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">文件系统</th>
<th scope="col" class="org-left"><code>file</code></th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><code>remote_file</code></th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><code>cookbook_file</code></th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><code>template</code></th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><code>directory</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">系统</td>
<td class="org-left"><code>package</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>service</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">脚本</td>
<td class="org-left"><code>bash</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>execute</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">用户</td>
<td class="org-left"><code>user</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>group</code></td>
</tr>
</tbody>
</table>
</div>
