programming/devops/chef.org
** Guards

[[https://docs.chef.io/resource_common.html#guards][Chef Docs | Guards]]

Guard 语句决定是否执行 resource。

#+BEGIN_SRC ruby
<resource> ... do
  not_if|only_if '<bash_script>'
  not_if|only_if do
    <ruby_expr>
  end
end
#+END_SRC

#+CAPTION: =example.ruby=
#+BEGIN_SRC ruby
bash 'script' do
  code 'mkdir -p /var/www/foo/'
  not_if '[ -d /var/www/foo/ ]'
  # Or
  not_if do
    File.directory?('/var/www/foo/')
  end
end
#+END_SRC

** Notifications

[[https://docs.chef.io/resource_common.html#notifications][Chef Docs | Notifications]]

*** =notifies=

=notifies= 表示在一个 resource 的状态改变时（如文件被修改），通知另一个 resource 执行某动作。

#+BEGIN_SRC ruby
notifies :<action>, '<resource>[<name>]', :<timer>
  <action>   # 在指定 resource 上执行的动作
  <resource> # 指定 resource 类型
  <name>     # 指定 resource 名
  <timer>
    :before    # 在当前 resource 状态发生变化前执行动作
    :delayed   # 在 Chef Client 运行结束前执行动作
    :immediate # 立即执行动作
#+END_SRC

*** =subscribes=

=subscribes= 表示在另一个 resource 状态发生变化时（如文件被修改），在当前 resource 执行某动作。

#+BEGIN_SRC ruby
subscribes :<action>, '<resource>[<name>]', :<timer>
  <action>   # 在当前 resource 执行的动作
  <resource> # 指定 resource 类型
  <name>     # 指定 resource 名
  <timer>
    :before    # 在指定 resource 状态发生变化前执行动作
    :delayed   # 在 Chef Client 运行结束前执行动作
    :immediate # 立即执行动作
#+END_SRC

** =bash=

执行 Bash 脚本。

#+BEGIN_SRC ruby
bash '<name>' do
  action :run # 默认
         :nothing
  user '<user>' # 使用此用户运行脚本
  code '<script>'
  code <<-EOH
    <script>
  EOH
end
#+END_SRC

** =cookbook_file=

[[https://docs.chef.io/resource_cookbook_file.html][Chef Docs | cookbook_file Resource]]

=cookbook_file= 用于将 cookbook 内的文件复制到指定位置，文件只包含静态内容。

#+BEGIN_SRC ruby
cookbook_file '<path>' do
  action :create  # 默认
  source '<file>' # Chef 在 files/ 目录下查找文件
end
#+END_SRC

** =directory=

[[https://docs.chef.io/resource_directory.html][Chef Docs | directory Resource]]

#+BEGIN_SRC ruby
directory '<path>' do
  action :create # 默认
         :delete
  mode '<string>' # e.g. '0755'
  owner '<user>'
  group '<group>'
  recursive <bool>
end
#+END_SRC

** =execute=

[[https://docs.chef.io/resource_execute.html][Chef Docs | execute Resource]]

执行脚本，但不指定解析方式，由 Chef 决定如何执行。

#+BEGIN_SRC ruby
execute '<name>' do
  action :run # 默认
         :nothing
  user '<username>'
  command '<script>'
  command <<-EOH
    <script>
  EOH
end
#+END_SRC

** =file=

[[https://docs.chef.io/resource_file.html][Chef Docs | file Resource]]

#+BEGIN_SRC ruby
file '<path>' do
  action :create            # 默认
         :create_if_missing
         :delete
  content '<string>'
  owner '<string>'
  group '<string>'
end
#+END_SRC

** =group=

[[https://docs.chef.io/resource_group.html][Chef Docs | group Resource]]

#+BEGIN_SRC ruby
group '<name>' do
  action :create # 默认
         :remove
         :modify
  members ['<user>', ...]
  append <bool> # true = 添加成员到组，不影响已有成员
                # false = 将组中已有成员移除，再添加成员到组。默认
end
#+END_SRC

** =package=

#+BEGIN_SRC ruby
package '<name>' do
  action :install # 默认
         :remove
         :upgrade
         :nothing
end
#+END_SRC

** =remote_file=

[[https://docs.chef.io/resource_remote_file.html][Chef Docs | remote_file Resource]]

=remote_file= 用于获取远程文件并复制到指定位置。

#+BEGIN_SRC ruby
remote_file '<path>' do
  action :create # 默认
  source '<string>'
end
#+END_SRC

