programming/devops/chef.html

<div id="outline-container-org5734e2c" class="outline-3">
<h3 id="org5734e2c"><span class="section-number-3">4.1</span> Guards</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://docs.chef.io/resource_common.html#guards">Chef Docs | Guards</a>
</p>

<p>
Guard 语句决定是否执行 resource。
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;resource&gt; ... <span class="org-keyword">do</span>
  not_if|only_if <span class="org-string">'&lt;bash_script&gt;'</span>
  not_if|only_if <span class="org-keyword">do</span>
    &lt;ruby_expr&gt;
  <span class="org-keyword">end</span>
<span class="org-keyword">end</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span><code>example.ruby</code></label><pre class="src src-ruby">bash <span class="org-string">'script'</span> <span class="org-keyword">do</span>
  code <span class="org-string">'mkdir -p /var/www/foo/'</span>
  not_if <span class="org-string">'[ -d /var/www/foo/ ]'</span>
  <span class="org-comment-delimiter"># </span><span class="org-comment">Or</span>
  not_if <span class="org-keyword">do</span>
    <span class="org-type">File</span>.directory?(<span class="org-string">'/var/www/foo/'</span>)
  <span class="org-keyword">end</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a520c8" class="outline-3">
<h3 id="org9a520c8"><span class="section-number-3">4.2</span> Notifications</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<a href="https://docs.chef.io/resource_common.html#notifications">Chef Docs | Notifications</a>
</p>
</div>

<div id="outline-container-org6a5617b" class="outline-4">
<h4 id="org6a5617b"><span class="section-number-4">4.2.1</span> <code>notifies</code></h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
<code>notifies</code> 表示在一个 resource 的状态改变时（如文件被修改），通知另一个 resource 执行某动作。
</p>

<div class="org-src-container">
<pre class="src src-ruby">notifies <span class="org-constant">:&lt;action</span>&gt;, <span class="org-string">'&lt;resource&gt;[&lt;name&gt;]'</span>, <span class="org-constant">:&lt;timer</span>&gt;
  &lt;action&gt;   <span class="org-comment-delimiter"># </span><span class="org-comment">&#22312;&#25351;&#23450; resource &#19978;&#25191;&#34892;&#30340;&#21160;&#20316;</span>
  &lt;resource&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#25351;&#23450; resource &#31867;&#22411;</span>
  &lt;name&gt;     <span class="org-comment-delimiter"># </span><span class="org-comment">&#25351;&#23450; resource &#21517;</span>
  &lt;timer&gt;
    <span class="org-constant">:before</span>    <span class="org-comment-delimiter"># </span><span class="org-comment">&#22312;&#24403;&#21069; resource &#29366;&#24577;&#21457;&#29983;&#21464;&#21270;&#21069;&#25191;&#34892;&#21160;&#20316;</span>
    <span class="org-constant">:delayed</span>   <span class="org-comment-delimiter"># </span><span class="org-comment">&#22312; Chef Client &#36816;&#34892;&#32467;&#26463;&#21069;&#25191;&#34892;&#21160;&#20316;</span>
    <span class="org-constant">:immediate</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#31435;&#21363;&#25191;&#34892;&#21160;&#20316;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org088660e" class="outline-4">
<h4 id="org088660e"><span class="section-number-4">4.2.2</span> <code>subscribes</code></h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
<code>subscribes</code> 表示在另一个 resource 状态发生变化时（如文件被修改），在当前 resource 执行某动作。
</p>

<div class="org-src-container">
<pre class="src src-ruby">subscribes <span class="org-constant">:&lt;action</span>&gt;, <span class="org-string">'&lt;resource&gt;[&lt;name&gt;]'</span>, <span class="org-constant">:&lt;timer</span>&gt;
  &lt;action&gt;   <span class="org-comment-delimiter"># </span><span class="org-comment">&#22312;&#24403;&#21069; resource &#25191;&#34892;&#30340;&#21160;&#20316;</span>
  &lt;resource&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#25351;&#23450; resource &#31867;&#22411;</span>
  &lt;name&gt;     <span class="org-comment-delimiter"># </span><span class="org-comment">&#25351;&#23450; resource &#21517;</span>
  &lt;timer&gt;
    <span class="org-constant">:before</span>    <span class="org-comment-delimiter"># </span><span class="org-comment">&#22312;&#25351;&#23450; resource &#29366;&#24577;&#21457;&#29983;&#21464;&#21270;&#21069;&#25191;&#34892;&#21160;&#20316;</span>
    <span class="org-constant">:delayed</span>   <span class="org-comment-delimiter"># </span><span class="org-comment">&#22312; Chef Client &#36816;&#34892;&#32467;&#26463;&#21069;&#25191;&#34892;&#21160;&#20316;</span>
    <span class="org-constant">:immediate</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#31435;&#21363;&#25191;&#34892;&#21160;&#20316;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org17a6635" class="outline-3">
<h3 id="org17a6635"><span class="section-number-3">4.3</span> <code>bash</code></h3>
<div class="outline-text-3" id="text-4-3">
<p>
执行 Bash 脚本。
</p>

<div class="org-src-container">
<pre class="src src-ruby">bash <span class="org-string">'&lt;name&gt;'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:run</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;</span>
         <span class="org-constant">:nothing</span>
  user <span class="org-string">'&lt;user&gt;'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#20351;&#29992;&#27492;&#29992;&#25143;&#36816;&#34892;&#33050;&#26412;</span>
  code <span class="org-string">'&lt;script&gt;'</span>
  code <span class="org-string">&lt;&lt;-EOH</span>
<span class="org-string">    &lt;script&gt;</span>
<span class="org-string">  EOH</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge69ddac" class="outline-3">
<h3 id="orge69ddac"><span class="section-number-3">4.4</span> <code>cookbook_file</code></h3>
<div class="outline-text-3" id="text-4-4">
<p>
<a href="https://docs.chef.io/resource_cookbook_file.html">Chef Docs | cookbook_file Resource</a>
</p>

<p>
<code>cookbook_file</code> 用于将 cookbook 内的文件复制到指定位置，文件只包含静态内容。
</p>

<div class="org-src-container">
<pre class="src src-ruby">cookbook_file <span class="org-string">'&lt;path&gt;'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:create</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;</span>
  source <span class="org-string">'&lt;file&gt;'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">Chef &#22312; files/ &#30446;&#24405;&#19979;&#26597;&#25214;&#25991;&#20214;</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge02f57d" class="outline-3">
<h3 id="orge02f57d"><span class="section-number-3">4.5</span> <code>directory</code></h3>
<div class="outline-text-3" id="text-4-5">
<p>
<a href="https://docs.chef.io/resource_directory.html">Chef Docs | directory Resource</a>
</p>

<div class="org-src-container">
<pre class="src src-ruby">directory <span class="org-string">'&lt;path&gt;'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:create</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;</span>
         <span class="org-constant">:delete</span>
  mode <span class="org-string">'&lt;string&gt;'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">e.g. '0755'</span>
  owner <span class="org-string">'&lt;user&gt;'</span>
  group <span class="org-string">'&lt;group&gt;'</span>
  recursive &lt;bool&gt;
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org91e57d1" class="outline-3">
<h3 id="org91e57d1"><span class="section-number-3">4.6</span> <code>execute</code></h3>
<div class="outline-text-3" id="text-4-6">
<p>
<a href="https://docs.chef.io/resource_execute.html">Chef Docs | execute Resource</a>
</p>

<p>
执行脚本，但不指定解析方式，由 Chef 决定如何执行。
</p>

<div class="org-src-container">
<pre class="src src-ruby">execute <span class="org-string">'&lt;name&gt;'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:run</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;</span>
         <span class="org-constant">:nothing</span>
  user <span class="org-string">'&lt;username&gt;'</span>
  command <span class="org-string">'&lt;script&gt;'</span>
  command <span class="org-string">&lt;&lt;-EOH</span>
<span class="org-string">    &lt;script&gt;</span>
<span class="org-string">  EOH</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org87a63ab" class="outline-3">
<h3 id="org87a63ab"><span class="section-number-3">4.7</span> <code>file</code></h3>
<div class="outline-text-3" id="text-4-7">
<p>
<a href="https://docs.chef.io/resource_file.html">Chef Docs | file Resource</a>
</p>

<div class="org-src-container">
<pre class="src src-ruby">file <span class="org-string">'&lt;path&gt;'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:create</span>            <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;</span>
         <span class="org-constant">:create_if_missing</span>
         <span class="org-constant">:delete</span>
  content <span class="org-string">'&lt;string&gt;'</span>
  owner <span class="org-string">'&lt;string&gt;'</span>
  group <span class="org-string">'&lt;string&gt;'</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4202cd" class="outline-3">
<h3 id="orgf4202cd"><span class="section-number-3">4.8</span> <code>group</code></h3>
<div class="outline-text-3" id="text-4-8">
<p>
<a href="https://docs.chef.io/resource_group.html">Chef Docs | group Resource</a>
</p>

<div class="org-src-container">
<pre class="src src-ruby">group <span class="org-string">'&lt;name&gt;'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:create</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;</span>
         <span class="org-constant">:remove</span>
         <span class="org-constant">:modify</span>
  members [<span class="org-string">'&lt;user&gt;'</span>, ...]
  append &lt;bool&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">true = &#28155;&#21152;&#25104;&#21592;&#21040;&#32452;&#65292;&#19981;&#24433;&#21709;&#24050;&#26377;&#25104;&#21592;</span>
                <span class="org-comment-delimiter"># </span><span class="org-comment">false = &#23558;&#32452;&#20013;&#24050;&#26377;&#25104;&#21592;&#31227;&#38500;&#65292;&#20877;&#28155;&#21152;&#25104;&#21592;&#21040;&#32452;&#12290;&#40664;&#35748;</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3285ea1" class="outline-3">
<h3 id="org3285ea1"><span class="section-number-3">4.9</span> <code>package</code></h3>
<div class="outline-text-3" id="text-4-9">
<div class="org-src-container">
<pre class="src src-ruby">package <span class="org-string">'&lt;name&gt;'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:install</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;</span>
         <span class="org-constant">:remove</span>
         <span class="org-constant">:upgrade</span>
         <span class="org-constant">:nothing</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5182fc1" class="outline-3">
<h3 id="org5182fc1"><span class="section-number-3">4.10</span> <code>remote_file</code></h3>
<div class="outline-text-3" id="text-4-10">
<p>
<a href="https://docs.chef.io/resource_remote_file.html">Chef Docs | remote_file Resource</a>
</p>

<p>
<code>remote_file</code> 用于获取远程文件并复制到指定位置。
</p>

<div class="org-src-container">
<pre class="src src-ruby">remote_file <span class="org-string">'&lt;path&gt;'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:create</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;</span>
  source <span class="org-string">'&lt;string&gt;'</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>
