programming/devops/chef.org
** =service=

#+BEGIN_SRC ruby
service '<name>' do
  action :enable
         :disable
         :start
         :stop
         :reload
         :restart
         :nothing # 默认
  action [:<action>, ...] # 多个 action，如 [:enable, :start]
end
#+END_SRC

** =template=

#+BEGIN_SRC ruby
template '<path>' do
  action :create          # 默认
  source '<template>.erb' # Chef 在 templates/ 目录下查找模版文件
  variables(
    :<name> => <value>
  )
end
#+END_SRC

** =user=

[[https://docs.chef.io/resource_user.html][Chef Docs | user Resource]]

#+BEGIN_SRC ruby
user '<name>' do
  action :create # 默认
         :remove
         :modify
  uid '<id>'
  gid '<id>'
  home '<path>'
  shell '<string>' # e.g. '/bin/bash'
  comment '<string>'
end
#+END_SRC

* Recipe

Recipe 是 Ruby 文件，包含一组 resource，resource 按照在 recipe 中出现的顺序被执行。Recipe 可以包含任意 Ruby 代码。

** =include_recipe=

引用其他 recipe。如果引用其他 cookbook 的 recipe，需要将引用的 cookbook 配置为依赖。

#+BEGIN_SRC ruby
include_recipe '<cookbook>::<recipe>'
#+END_SRC

* Template

[[https://docs.chef.io/templates.html][Chef Docs | About Templates]] \\
[[https://docs.chef.io/resource_template.html][Chef Docs | Template Resource]]

Embedded Ruby (ERB) 模版是嵌入 Ruby 表达式的文本文件，在 recipe 中通过 =template= 资源引用模版，可以生成动态内容的文本文件。

#+BEGIN_SRC erb
<% ... %>  // Statement, e.g. <% if ... %> 
<%= ... %> // Expression, e.g. <%= 1 + 2 %>

<%= node[...] %> // 
<%= @var %>      // Variable
#+END_SRC

* Cookbook

#+BEGIN_SRC sh
<cookbook>/    # The cookbook directory
  .kitchen.yml # Kitchen config file
  Berksfile    # Cookbook dependencies
  chefignore   # Dirs and files to exclude from Chef, similar to gitignore
  metadata.rb  # Versions and dependencies
  README.md
  recipes/
    <recipe>.rb
    ...
  spec/
    unit/     # Unit tests
  test/       # Integration tests
#+END_SRC

** =metadata.rb=

#+BEGIN_SRC ruby
version '<version>'                  # Cookbook 的版本
depends '<cookbook>', '~> <version>' # 依赖及依赖的版本
#+END_SRC

* Role

Role 用于管理节点需要运行的 recipe 列表，相对于手动添加 recipe 到节点的 run list，role 定义一个 recipe 列表，属于此 role 的节点会按顺序运行列表中的 recipe。

** 配置

Role 配置可以为 Ruby 或 JSON。

#+CAPTION: =<repo>/roles/<role>.rb=
#+BEGIN_SRC ruby
name '<name>'
description '<desc>'
run_list 'recipe[<cookbook>::<recipe>]',...
default_attributes # 设置 node 对象的属性
override_attributes({
  '<name>' => <value>
})
#+END_SRC

Role 可以通过 run-list 嵌套：

#+BEGIN_SRC ruby
run_list 'role[base]',...
#+END_SRC

* Environment

[[https://docs.chef.io/environments.html][Chef Docs | About Environments]]

通过区分 Chef 资源所属的环境，可以实现不同的配置和行为，和运行同一 cookbook 的不同版本。Chef 资源默认属于 =_default= 环境。

** 配置

Environment 配置可以为 Ruby 或 JSON。

#+CAPTION: =<repo>/environments/<env>.rb=
#+BEGIN_SRC ruby
name '<name>'
description '<desc>'

# Cookbook 版本限制，如果为空则默认使用最新版本
cookbook '<cookbook>', '<version_expr>'
cookbook ...
#+END_SRC

* Ohai

[[https://docs.chef.io/ohai.html][Chef Docs | About Ohai]]

Ohai 在 Chef Client 运行时收集系统信息，如主机名、IP 地址等，并创建一个 =node= 对象提供给 recipe 使用。

** =node=

#+BEGIN_SRC ruby
node['<attribute>']...
  ipaddress
  hostname
  memory
    total
#+END_SRC

在 recipe 中使用 =node= 对象：

#+BEGIN_SRC ruby
file '/tmp/...' do
  content "Hostname is #{node['hostname']}"
end
#+END_SRC

* Test Kitchen

Test Kithen 用于集成测试，即创建一个实例（如虚拟机），在实例上运行指定 Chef reripe，然后运行测试代码检查实例的状态。

* ChefSpec

[[https://docs.chef.io/chefspec.html][Chef Docs | ChefSpec]]

ChefSpec 用于单元测试，即测试 Chef recipe 的编译结果 resource collection。

* Knife

[[https://docs.chef.io/knife.html][Chef Docs | Knife]]

Knife 是用于连接 Chef Server 的命令行工具。

* Berkshelf

[[https://docs.chef.io/berkshelf.html][Chef Docs | About Berkshelf]]

Berkshelf 是 Chef 的依赖管理器。

