programming/devops/chef.html

<div id="outline-container-orgfcc7814" class="outline-3">
<h3 id="orgfcc7814"><span class="section-number-3">4.11</span> <code>service</code></h3>
<div class="outline-text-3" id="text-4-11">
<div class="org-src-container">
<pre class="src src-ruby">service <span class="org-string">'&lt;name&gt;'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:enable</span>
         <span class="org-constant">:disable</span>
         <span class="org-constant">:start</span>
         <span class="org-constant">:stop</span>
         <span class="org-constant">:reload</span>
         <span class="org-constant">:restart</span>
         <span class="org-constant">:nothing</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;</span>
  action [<span class="org-constant">:&lt;action</span>&gt;, ...] <span class="org-comment-delimiter"># </span><span class="org-comment">&#22810;&#20010; action&#65292;&#22914; [:enable, :start]</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org965c71f" class="outline-3">
<h3 id="org965c71f"><span class="section-number-3">4.12</span> <code>template</code></h3>
<div class="outline-text-3" id="text-4-12">
<div class="org-src-container">
<pre class="src src-ruby">template <span class="org-string">'&lt;path&gt;'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:create</span>          <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;</span>
  source <span class="org-string">'&lt;template&gt;.erb'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">Chef &#22312; templates/ &#30446;&#24405;&#19979;&#26597;&#25214;&#27169;&#29256;&#25991;&#20214;</span>
  variables(
    <span class="org-constant">:&lt;name</span>&gt; =&gt; &lt;value&gt;
  )
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f8778c" class="outline-3">
<h3 id="org3f8778c"><span class="section-number-3">4.13</span> <code>user</code></h3>
<div class="outline-text-3" id="text-4-13">
<p>
<a href="https://docs.chef.io/resource_user.html">Chef Docs | user Resource</a>
</p>

<div class="org-src-container">
<pre class="src src-ruby">user <span class="org-string">'&lt;name&gt;'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:create</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;</span>
         <span class="org-constant">:remove</span>
         <span class="org-constant">:modify</span>
  uid <span class="org-string">'&lt;id&gt;'</span>
  gid <span class="org-string">'&lt;id&gt;'</span>
  home <span class="org-string">'&lt;path&gt;'</span>
  shell <span class="org-string">'&lt;string&gt;'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">e.g. '/bin/bash'</span>
  comment <span class="org-string">'&lt;string&gt;'</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgba61caa" class="outline-2">
<h2 id="orgba61caa"><span class="section-number-2">5</span> Recipe</h2>
<div class="outline-text-2" id="text-5">
<p>
Recipe 是 Ruby 文件，包含一组 resource，resource 按照在 recipe 中出现的顺序被执行。Recipe 可以包含任意 Ruby 代码。
</p>
</div>

<div id="outline-container-org43da4a4" class="outline-3">
<h3 id="org43da4a4"><span class="section-number-3">5.1</span> <code>include_recipe</code></h3>
<div class="outline-text-3" id="text-5-1">
<p>
引用其他 recipe。如果引用其他 cookbook 的 recipe，需要将引用的 cookbook 配置为依赖。
</p>

<div class="org-src-container">
<pre class="src src-ruby">include_recipe <span class="org-string">'&lt;cookbook&gt;::&lt;recipe&gt;'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge035cd7" class="outline-2">
<h2 id="orge035cd7"><span class="section-number-2">6</span> Template</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="https://docs.chef.io/templates.html">Chef Docs | About Templates</a> <br />
<a href="https://docs.chef.io/resource_template.html">Chef Docs | Template Resource</a>
</p>

<p>
Embedded Ruby (ERB) 模版是嵌入 Ruby 表达式的文本文件，在 recipe 中通过 <code>template</code> 资源引用模版，可以生成动态内容的文本文件。
</p>

<div class="org-src-container">
<pre class="src src-erb">&lt;% ... %&gt;  // Statement, e.g. &lt;% if ... %&gt; 
&lt;%= ... %&gt; // Expression, e.g. &lt;%= 1 + 2 %&gt;

&lt;%= node[...] %&gt; // 
&lt;%= <span class="org-web-mode-keyword">@var</span> %&gt;      // Variable
</pre>
</div>
</div>
</div>

<div id="outline-container-orga640d32" class="outline-2">
<h2 id="orga640d32"><span class="section-number-2">7</span> Cookbook</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-sh">&lt;cookbook&gt;/    <span class="org-comment-delimiter"># </span><span class="org-comment">The cookbook directory</span>
  .kitchen.yml <span class="org-comment-delimiter"># </span><span class="org-comment">Kitchen config file</span>
  Berksfile    <span class="org-comment-delimiter"># </span><span class="org-comment">Cookbook dependencies</span>
  chefignore   <span class="org-comment-delimiter"># </span><span class="org-comment">Dirs and files to exclude from Chef, similar to gitignore</span>
  metadata.rb  <span class="org-comment-delimiter"># </span><span class="org-comment">Versions and dependencies</span>
  README.md
  recipes/
    &lt;recipe&gt;.rb
    ...
  spec/
    unit/     <span class="org-comment-delimiter"># </span><span class="org-comment">Unit tests</span>
  test/       <span class="org-comment-delimiter"># </span><span class="org-comment">Integration tests</span>
</pre>
</div>
</div>

<div id="outline-container-org96e6fb2" class="outline-3">
<h3 id="org96e6fb2"><span class="section-number-3">7.1</span> <code>metadata.rb</code></h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-ruby">version <span class="org-string">'&lt;version&gt;'</span>                  <span class="org-comment-delimiter"># </span><span class="org-comment">Cookbook &#30340;&#29256;&#26412;</span>
depends <span class="org-string">'&lt;cookbook&gt;'</span>, <span class="org-string">'~&gt; &lt;version&gt;'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#20381;&#36182;&#21450;&#20381;&#36182;&#30340;&#29256;&#26412;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3cf8bbd" class="outline-2">
<h2 id="org3cf8bbd"><span class="section-number-2">8</span> Role</h2>
<div class="outline-text-2" id="text-8">
<p>
Role 用于管理节点需要运行的 recipe 列表，相对于手动添加 recipe 到节点的 run list，role 定义一个 recipe 列表，属于此 role 的节点会按顺序运行列表中的 recipe。
</p>
</div>

<div id="outline-container-orgeb9d7cb" class="outline-3">
<h3 id="orgeb9d7cb"><span class="section-number-3">8.1</span> 配置</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Role 配置可以为 Ruby 或 JSON。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span><code>&lt;repo&gt;/roles/&lt;role&gt;.rb</code></label><pre class="src src-ruby">name <span class="org-string">'&lt;name&gt;'</span>
description <span class="org-string">'&lt;desc&gt;'</span>
run_list <span class="org-string">'recipe[&lt;cookbook&gt;::&lt;recipe&gt;]'</span>,...
default_attributes <span class="org-comment-delimiter"># </span><span class="org-comment">&#35774;&#32622; node &#23545;&#35937;&#30340;&#23646;&#24615;</span>
override_attributes({
  <span class="org-string">'&lt;name&gt;'</span> =&gt; &lt;value&gt;
})
</pre>
</div>

<p>
Role 可以通过 run-list 嵌套：
</p>

<div class="org-src-container">
<pre class="src src-ruby">run_list <span class="org-string">'role[base]'</span>,...
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgda881fb" class="outline-2">
<h2 id="orgda881fb"><span class="section-number-2">9</span> Environment</h2>
<div class="outline-text-2" id="text-9">
<p>
<a href="https://docs.chef.io/environments.html">Chef Docs | About Environments</a>
</p>

<p>
通过区分 Chef 资源所属的环境，可以实现不同的配置和行为，和运行同一 cookbook 的不同版本。Chef 资源默认属于 <code>_default</code> 环境。
</p>
</div>

<div id="outline-container-org4cd8cfc" class="outline-3">
<h3 id="org4cd8cfc"><span class="section-number-3">9.1</span> 配置</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Environment 配置可以为 Ruby 或 JSON。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span><code>&lt;repo&gt;/environments/&lt;env&gt;.rb</code></label><pre class="src src-ruby">name <span class="org-string">'&lt;name&gt;'</span>
description <span class="org-string">'&lt;desc&gt;'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Cookbook &#29256;&#26412;&#38480;&#21046;&#65292;&#22914;&#26524;&#20026;&#31354;&#21017;&#40664;&#35748;&#20351;&#29992;&#26368;&#26032;&#29256;&#26412;</span>
cookbook <span class="org-string">'&lt;cookbook&gt;'</span>, <span class="org-string">'&lt;version_expr&gt;'</span>
cookbook ...
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9b19179" class="outline-2">
<h2 id="org9b19179"><span class="section-number-2">10</span> Ohai</h2>
<div class="outline-text-2" id="text-10">
<p>
<a href="https://docs.chef.io/ohai.html">Chef Docs | About Ohai</a>
</p>

<p>
Ohai 在 Chef Client 运行时收集系统信息，如主机名、IP 地址等，并创建一个 <code>node</code> 对象提供给 recipe 使用。
</p>
</div>

<div id="outline-container-org8177ec6" class="outline-3">
<h3 id="org8177ec6"><span class="section-number-3">10.1</span> <code>node</code></h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-ruby">node[<span class="org-string">'&lt;attribute&gt;'</span>]...
  ipaddress
  hostname
  memory
    total
</pre>
</div>

<p>
在 recipe 中使用 <code>node</code> 对象：
</p>

<div class="org-src-container">
<pre class="src src-ruby">file <span class="org-string">'/tmp/...'</span> <span class="org-keyword">do</span>
  content <span class="org-string">"Hostname is </span><span class="org-variable-name">#{node['hostname']}</span><span class="org-string">"</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb99ea2a" class="outline-2">
<h2 id="orgb99ea2a"><span class="section-number-2">11</span> Test Kitchen</h2>
<div class="outline-text-2" id="text-11">
<p>
Test Kithen 用于集成测试，即创建一个实例（如虚拟机），在实例上运行指定 Chef reripe，然后运行测试代码检查实例的状态。
</p>
</div>
</div>

<div id="outline-container-orgdb486aa" class="outline-2">
<h2 id="orgdb486aa"><span class="section-number-2">12</span> ChefSpec</h2>
<div class="outline-text-2" id="text-12">
<p>
<a href="https://docs.chef.io/chefspec.html">Chef Docs | ChefSpec</a>
</p>

<p>
ChefSpec 用于单元测试，即测试 Chef recipe 的编译结果 resource collection。
</p>
</div>
</div>

<div id="outline-container-org96756d2" class="outline-2">
<h2 id="org96756d2"><span class="section-number-2">13</span> Knife</h2>
<div class="outline-text-2" id="text-13">
<p>
<a href="https://docs.chef.io/knife.html">Chef Docs | Knife</a>
</p>

<p>
Knife 是用于连接 Chef Server 的命令行工具。
</p>
</div>
</div>

<div id="outline-container-org30e8fe2" class="outline-2">
<h2 id="org30e8fe2"><span class="section-number-2">14</span> Berkshelf</h2>
<div class="outline-text-2" id="text-14">
<p>
<a href="https://docs.chef.io/berkshelf.html">Chef Docs | About Berkshelf</a>
</p>

<p>
Berkshelf 是 Chef 的依赖管理器。
</p>
</div>
