programming/devops/chef.org
** 配置

在生成 cookbook 时 Chef 自动生成 Berkshelf 配置文件 =Berksfile= 。

#+CAPTION: =<cookbook>/Berksfile=
#+BEGIN_SRC sh
source '<url>' # 默认为 https://supermarket.chef.io
metadata # 在 metadata 文件中查找依赖和版本信息
#+END_SRC

安装依赖时 Berkshelf 自动生成 =Berkshelf.lock= 文件，记录依赖关系和版本信息。

** 依赖

Berkshelf 将依赖的 cookbook 安装在 =~/.berkshelf/cookbooks/= 目录下。

* =chef=
** =exec=

运行 ChefSpec：

#+BEGIN_SRC sh
chef exec rspec <path_to_test>/<test>_spec.rb
#+END_SRC

** =generate=

#+BEGIN_SRC sh
chef generate <type> <options>
#+END_SRC

*** =cookbook=

#+BEGIN_SRC sh
chef generate cookbook <path> <options>
    <path> # e.g. cookbooks/mycookbook
#+END_SRC

*** =file=

#+BEGIN_SRC sh
chef generate file <path> <name>
    <path> # Cookbook 的路径，不包含 files/
    <name>
#+END_SRC

*** =recipe=

#+BEGIN_SRC sh
chef generate recipe <path> <name>
    <path> # Cookbook 的路径，不包含 recipes/
    <name> # 不包含 .rb
#+END_SRC

*** =template=

#+BEGIN_SRC sh
chef generate template <path> <name> <options>
    <path> # Cookbook 的路径，不包含 templates/
#+END_SRC

* =chef-client=

#+BEGIN_SRC sh
chef-client <options> <recipe>
    -r, --runlist
        "recipe[<cookbook>]"                      # 运行 default recipe
        "recipe[<cookbook>::<recipe>]"            # 运行一个 recipe
        "<cookbook>::<recipe>"                    # 只有一个 recipe 时可以省略 recipe[]
        "recipe[<cookbook>::<recipe>],recipe[..." # 运行多个 recipe，注意 runlist 不能包含空格
    -z, --local-mode # 本地模式，不依赖 Chef Server
    <recipe> # 执行 recipe 文件
#+END_SRC

* =ohai=

查看系统信息。

#+BEGIN_SRC sh
ohai <attribute>/...
#+END_SRC

* =kitchen=

| *测试流程* | =create=   | 创建实例                  |
|            | =converge= | 使用 provisioner 配置实例 |
|            | =verify=   | 运行测试                  |
|            | =destroy=  | 销毁实例                  |
|------------+------------+---------------------------|
|            | =login=    | 登录到实例                |

* =knife=
** =bootstrap=

#+BEGIN_SRC sh
knife bootstrap <fqdn> <options>
  -N, --node-name <name> # Node name
  -r, --run-list <list>  # Run list
    "recipe[<cookbook>]"
    "role[<name>]"
  -i <file>              # Identity file
  -x, --ssh-user <user>
  -P, --ssh-password <password>
  -p, --ssh-port <port>
  --sudo                 # Execute bootstrap with sudo
#+END_SRC

** =cookbook=

#+BEGIN_SRC sh
knife cookbook
  list <options>            # Cookbook 列表
  show <cookbook> <version> # Cookbook 信息
  upload <cookbook>         # 上传 cookbook
#+END_SRC

** =data bag=

#+BEGIN_SRC sh
knife data bag
  list                   # Data bag 列表
  show <bag>             # Data bag 信息
  show <bag>/<item>      # Data bag item 键名列表
  show <bag> <item>      # Data bag item 详细信息
    --secret-file <path> # 密钥文件，用于解密加密的 data bag item
  create <bag>           # 创建 data bag
    --secret-file <path> # 密钥文件，用于创建加密的 data bag
  from file <bag> <path> # 从 JSON 文件创建并上传 data bag item
    --secret-file <path> # 密钥文件，用于上传到加密的 data bag
#+END_SRC

** =environment=

#+BEGIN_SRC sh
knife environment list             # 环境列表
knife environment show <env>       # 环境信息
knife environment from file <path> # 从文件创建或更新
#+END_SRC

