programming/devops/chef.html

<div id="outline-container-org80271c9" class="outline-3">
<h3 id="org80271c9"><span class="section-number-3">14.1</span> 配置</h3>
<div class="outline-text-3" id="text-14-1">
<p>
在生成 cookbook 时 Chef 自动生成 Berkshelf 配置文件 <code>Berksfile</code> 。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span><code>&lt;cookbook&gt;/Berksfile</code></label><pre class="src src-sh"><span class="org-builtin">source</span> <span class="org-string">'&lt;url&gt;'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;&#20026; https://supermarket.chef.io</span>
metadata <span class="org-comment-delimiter"># </span><span class="org-comment">&#22312; metadata &#25991;&#20214;&#20013;&#26597;&#25214;&#20381;&#36182;&#21644;&#29256;&#26412;&#20449;&#24687;</span>
</pre>
</div>

<p>
安装依赖时 Berkshelf 自动生成 <code>Berkshelf.lock</code> 文件，记录依赖关系和版本信息。
</p>
</div>
</div>

<div id="outline-container-orgb4f2797" class="outline-3">
<h3 id="orgb4f2797"><span class="section-number-3">14.2</span> 依赖</h3>
<div class="outline-text-3" id="text-14-2">
<p>
Berkshelf 将依赖的 cookbook 安装在 <code>~/.berkshelf/cookbooks/</code> 目录下。
</p>
</div>
</div>
</div>

<div id="outline-container-org1848e8b" class="outline-2">
<h2 id="org1848e8b"><span class="section-number-2">15</span> <code>chef</code></h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-org05c128e" class="outline-3">
<h3 id="org05c128e"><span class="section-number-3">15.1</span> <code>exec</code></h3>
<div class="outline-text-3" id="text-15-1">
<p>
运行 ChefSpec：
</p>

<div class="org-src-container">
<pre class="src src-sh">chef exec rspec &lt;path_to_test&gt;/&lt;test&gt;_spec.rb
</pre>
</div>
</div>
</div>

<div id="outline-container-org63b6cc2" class="outline-3">
<h3 id="org63b6cc2"><span class="section-number-3">15.2</span> <code>generate</code></h3>
<div class="outline-text-3" id="text-15-2">
<div class="org-src-container">
<pre class="src src-sh">chef generate &lt;type&gt; &lt;options&gt;
</pre>
</div>
</div>

<div id="outline-container-org7701fb8" class="outline-4">
<h4 id="org7701fb8"><span class="section-number-4">15.2.1</span> <code>cookbook</code></h4>
<div class="outline-text-4" id="text-15-2-1">
<div class="org-src-container">
<pre class="src src-sh">chef generate cookbook &lt;path&gt; &lt;options&gt;
    &lt;path&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">e.g. cookbooks/mycookbook</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d93561" class="outline-4">
<h4 id="org1d93561"><span class="section-number-4">15.2.2</span> <code>file</code></h4>
<div class="outline-text-4" id="text-15-2-2">
<div class="org-src-container">
<pre class="src src-sh">chef generate file &lt;path&gt; &lt;name&gt;
    &lt;path&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">Cookbook &#30340;&#36335;&#24452;&#65292;&#19981;&#21253;&#21547; files/</span>
    &lt;name&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org703135b" class="outline-4">
<h4 id="org703135b"><span class="section-number-4">15.2.3</span> <code>recipe</code></h4>
<div class="outline-text-4" id="text-15-2-3">
<div class="org-src-container">
<pre class="src src-sh">chef generate recipe &lt;path&gt; &lt;name&gt;
    &lt;path&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">Cookbook &#30340;&#36335;&#24452;&#65292;&#19981;&#21253;&#21547; recipes/</span>
    &lt;name&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#19981;&#21253;&#21547; .rb</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd99a49b" class="outline-4">
<h4 id="orgd99a49b"><span class="section-number-4">15.2.4</span> <code>template</code></h4>
<div class="outline-text-4" id="text-15-2-4">
<div class="org-src-container">
<pre class="src src-sh">chef generate template &lt;path&gt; &lt;name&gt; &lt;options&gt;
    &lt;path&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">Cookbook &#30340;&#36335;&#24452;&#65292;&#19981;&#21253;&#21547; templates/</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org3a6b5ea" class="outline-2">
<h2 id="org3a6b5ea"><span class="section-number-2">16</span> <code>chef-client</code></h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-sh">chef-client &lt;options&gt; &lt;recipe&gt;
    -r, --runlist
        <span class="org-string">"recipe[&lt;cookbook&gt;]"</span>                      <span class="org-comment-delimiter"># </span><span class="org-comment">&#36816;&#34892; default recipe</span>
        <span class="org-string">"recipe[&lt;cookbook&gt;::&lt;recipe&gt;]"</span>            <span class="org-comment-delimiter"># </span><span class="org-comment">&#36816;&#34892;&#19968;&#20010; recipe</span>
        <span class="org-string">"&lt;cookbook&gt;::&lt;recipe&gt;"</span>                    <span class="org-comment-delimiter"># </span><span class="org-comment">&#21482;&#26377;&#19968;&#20010; recipe &#26102;&#21487;&#20197;&#30465;&#30053; recipe[]</span>
        <span class="org-string">"recipe[&lt;cookbook&gt;::&lt;recipe&gt;],recipe[..."</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#36816;&#34892;&#22810;&#20010; recipe&#65292;&#27880;&#24847; runlist &#19981;&#33021;&#21253;&#21547;&#31354;&#26684;</span>
    -z, --local-mode <span class="org-comment-delimiter"># </span><span class="org-comment">&#26412;&#22320;&#27169;&#24335;&#65292;&#19981;&#20381;&#36182; Chef Server</span>
    &lt;recipe&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#25191;&#34892; recipe &#25991;&#20214;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4b47f94" class="outline-2">
<h2 id="org4b47f94"><span class="section-number-2">17</span> <code>ohai</code></h2>
<div class="outline-text-2" id="text-17">
<p>
查看系统信息。
</p>

<div class="org-src-container">
<pre class="src src-sh">ohai &lt;attribute&gt;/...
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d15ff6" class="outline-2">
<h2 id="org7d15ff6"><span class="section-number-2">18</span> <code>kitchen</code></h2>
<div class="outline-text-2" id="text-18">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>测试流程</b></th>
<th scope="col" class="org-left"><code>create</code></th>
<th scope="col" class="org-left">创建实例</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><code>converge</code></th>
<th scope="col" class="org-left">使用 provisioner 配置实例</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><code>verify</code></th>
<th scope="col" class="org-left">运行测试</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><code>destroy</code></th>
<th scope="col" class="org-left">销毁实例</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>login</code></td>
<td class="org-left">登录到实例</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgca6d2bc" class="outline-2">
<h2 id="orgca6d2bc"><span class="section-number-2">19</span> <code>knife</code></h2>
<div class="outline-text-2" id="text-19">
</div><div id="outline-container-org745964b" class="outline-3">
<h3 id="org745964b"><span class="section-number-3">19.1</span> <code>bootstrap</code></h3>
<div class="outline-text-3" id="text-19-1">
<div class="org-src-container">
<pre class="src src-sh">knife bootstrap &lt;fqdn&gt; &lt;options&gt;
  -N, --node-name &lt;name&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">Node name</span>
  -r, --run-list &lt;list&gt;  <span class="org-comment-delimiter"># </span><span class="org-comment">Run list</span>
    <span class="org-string">"recipe[&lt;cookbook&gt;]"</span>
    <span class="org-string">"role[&lt;name&gt;]"</span>
  -i &lt;file&gt;              <span class="org-comment-delimiter"># </span><span class="org-comment">Identity file</span>
  -x, --ssh-user &lt;user&gt;
  -P, --ssh-password &lt;password&gt;
  -p, --ssh-port &lt;port&gt;
  --sudo                 <span class="org-comment-delimiter"># </span><span class="org-comment">Execute bootstrap with sudo</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4e73ee" class="outline-3">
<h3 id="orgc4e73ee"><span class="section-number-3">19.2</span> <code>cookbook</code></h3>
<div class="outline-text-3" id="text-19-2">
<div class="org-src-container">
<pre class="src src-sh">knife cookbook
  list &lt;options&gt;            <span class="org-comment-delimiter"># </span><span class="org-comment">Cookbook &#21015;&#34920;</span>
  show &lt;cookbook&gt; &lt;version&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">Cookbook &#20449;&#24687;</span>
  upload &lt;cookbook&gt;         <span class="org-comment-delimiter"># </span><span class="org-comment">&#19978;&#20256; cookbook</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org76020e5" class="outline-3">
<h3 id="org76020e5"><span class="section-number-3">19.3</span> <code>data bag</code></h3>
<div class="outline-text-3" id="text-19-3">
<div class="org-src-container">
<pre class="src src-sh">knife data bag
  list                   <span class="org-comment-delimiter"># </span><span class="org-comment">Data bag &#21015;&#34920;</span>
  show &lt;bag&gt;             <span class="org-comment-delimiter"># </span><span class="org-comment">Data bag &#20449;&#24687;</span>
  show &lt;bag&gt;/&lt;item&gt;      <span class="org-comment-delimiter"># </span><span class="org-comment">Data bag item &#38190;&#21517;&#21015;&#34920;</span>
  show &lt;bag&gt; &lt;item&gt;      <span class="org-comment-delimiter"># </span><span class="org-comment">Data bag item &#35814;&#32454;&#20449;&#24687;</span>
    --secret-file &lt;path&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#23494;&#38053;&#25991;&#20214;&#65292;&#29992;&#20110;&#35299;&#23494;&#21152;&#23494;&#30340; data bag item</span>
  create &lt;bag&gt;           <span class="org-comment-delimiter"># </span><span class="org-comment">&#21019;&#24314; data bag</span>
    --secret-file &lt;path&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#23494;&#38053;&#25991;&#20214;&#65292;&#29992;&#20110;&#21019;&#24314;&#21152;&#23494;&#30340; data bag</span>
  from file &lt;bag&gt; &lt;path&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#20174; JSON &#25991;&#20214;&#21019;&#24314;&#24182;&#19978;&#20256; data bag item</span>
    --secret-file &lt;path&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#23494;&#38053;&#25991;&#20214;&#65292;&#29992;&#20110;&#19978;&#20256;&#21040;&#21152;&#23494;&#30340; data bag</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org34290f4" class="outline-3">
<h3 id="org34290f4"><span class="section-number-3">19.4</span> <code>environment</code></h3>
<div class="outline-text-3" id="text-19-4">
<div class="org-src-container">
<pre class="src src-sh">knife environment list             <span class="org-comment-delimiter"># </span><span class="org-comment">&#29615;&#22659;&#21015;&#34920;</span>
knife environment show &lt;env&gt;       <span class="org-comment-delimiter"># </span><span class="org-comment">&#29615;&#22659;&#20449;&#24687;</span>
knife environment from file &lt;path&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#20174;&#25991;&#20214;&#21019;&#24314;&#25110;&#26356;&#26032;</span>
</pre>
</div>
</div>
</div>
