programming/devops/chef.org
** =node=

显示单个节点信息。

#+BEGIN_SRC sh
knife node list <options> # Node 列表

knife node show <node> <options> # Node 信息
  -a, --attribute <attr>         # 属性，e.g. -a node

knife node run_list
  add <node> "recipe[<cookbook>],..." # 增加 run list
  set <node> "recipe[<cookbook>],..." # 设置 run list
  set <node> "role[<name>]"           # 设置 role

knife node environment
  set <node> <env> # 设置环境
#+END_SRC

** =role=

#+BEGIN_SRC sh
knife role list             # Role 列表
knife role show <name>      # Role 信息
knife role from file <path> # 从文件创建或更新
#+END_SRC

** =search=

在 Chef Server 的索引中检索节点等信息。

#+BEGIN_SRC sh
knife search <index> <query> <options>
  <index>
    client
    environment
    node
    role
    databag
  <query>
    "<attr>:<value> ..." # e.g. "role:web"
                         # e.g. "role:web AND recipes:apache"
    "*:*" # All
  <options>
    -a, --attribute <attr> # e.g. ipaddress
#+END_SRC

** =ssh=

SSH 连接到节点并运行命令。

#+BEGIN_SRC sh
knife ssh <query> <command> <options>
  <query>
    <host>        # e.g. localhost
    <ip>          # e.g. 127.0.0.1    
    "*:*"         # 所有节点
    "role:<role>" # 属于 role 的节点 
  <options>
    -m, --manual-list # <query> 是手动的服务器名
    -p, --ssh-port <port>
    -x, --ssh-user <name>
    -i, --ssh-identity-file <path>
#+END_SRC

** =vault=

=chef-vault= 使用公钥加密 data bag item，拥有私钥的节点能够解密。

* =berks=
** =install=

#+BEGIN_SRC sh
berks install # 安装依赖到本地
#+END_SRC

** =upload=

上传依赖到 Chef Server。

#+BEGIN_SRC sh
berks upload <options>
  --force # 强制上传，默认只上传版本变化的 cookbook
#+END_SRC

* =cookstyle=

检查 recipe 语法和样式，基于 Ruby 静态分析器 [[https://github.com/rubocop-hq/rubocop][RuboCop]] 。

#+BEGIN_SRC sh
cookstyle <options> <file> ...
#+END_SRC

* 链接

1. [[https://docs.chef.io/][Chef Docs]]
1. [[http://www.foodcritic.io/][Foodcritic]]
1. [[https://kitchen.ci/][Test Kitchen]]
1. [[https://www.inspec.io/][InSpec]]
1. [[https://supermarket.chef.io/][Chef Supermarket]]
