programming/devops/chef.html

<div id="outline-container-org815ba96" class="outline-3">
<h3 id="org815ba96"><span class="section-number-3">19.5</span> <code>node</code></h3>
<div class="outline-text-3" id="text-19-5">
<p>
显示单个节点信息。
</p>

<div class="org-src-container">
<pre class="src src-sh">knife node list &lt;options&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">Node &#21015;&#34920;</span>

knife node show &lt;node&gt; &lt;options&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">Node &#20449;&#24687;</span>
  -a, --attribute &lt;attr&gt;         <span class="org-comment-delimiter"># </span><span class="org-comment">&#23646;&#24615;&#65292;e.g. -a node</span>

knife node run_list
  add &lt;node&gt; <span class="org-string">"recipe[&lt;cookbook&gt;],..."</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#22686;&#21152; run list</span>
  <span class="org-builtin">set</span> &lt;node&gt; <span class="org-string">"recipe[&lt;cookbook&gt;],..."</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#35774;&#32622; run list</span>
  <span class="org-builtin">set</span> &lt;node&gt; <span class="org-string">"role[&lt;name&gt;]"</span>           <span class="org-comment-delimiter"># </span><span class="org-comment">&#35774;&#32622; role</span>

knife node environment
  <span class="org-builtin">set</span> &lt;node&gt; &lt;env&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#35774;&#32622;&#29615;&#22659;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9f421ec" class="outline-3">
<h3 id="org9f421ec"><span class="section-number-3">19.6</span> <code>role</code></h3>
<div class="outline-text-3" id="text-19-6">
<div class="org-src-container">
<pre class="src src-sh">knife role list             <span class="org-comment-delimiter"># </span><span class="org-comment">Role &#21015;&#34920;</span>
knife role show &lt;name&gt;      <span class="org-comment-delimiter"># </span><span class="org-comment">Role &#20449;&#24687;</span>
knife role from file &lt;path&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#20174;&#25991;&#20214;&#21019;&#24314;&#25110;&#26356;&#26032;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b88ffc" class="outline-3">
<h3 id="org1b88ffc"><span class="section-number-3">19.7</span> <code>search</code></h3>
<div class="outline-text-3" id="text-19-7">
<p>
在 Chef Server 的索引中检索节点等信息。
</p>

<div class="org-src-container">
<pre class="src src-sh">knife search &lt;index&gt; &lt;query&gt; &lt;options&gt;
  &lt;index&gt;
    client
    environment
    node
    role
    databag
  &lt;query&gt;
    <span class="org-string">"&lt;attr&gt;:&lt;value&gt; ..."</span> <span class="org-comment-delimiter"># </span><span class="org-comment">e.g. "role:web"</span>
                         <span class="org-comment-delimiter"># </span><span class="org-comment">e.g. "role:web AND recipes:apache"</span>
    <span class="org-string">"*:*"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">All</span>
  &lt;options&gt;
    -a, --attribute &lt;attr&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">e.g. ipaddress</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0dcef30" class="outline-3">
<h3 id="org0dcef30"><span class="section-number-3">19.8</span> <code>ssh</code></h3>
<div class="outline-text-3" id="text-19-8">
<p>
SSH 连接到节点并运行命令。
</p>

<div class="org-src-container">
<pre class="src src-sh">knife ssh &lt;query&gt; &lt;command&gt; &lt;options&gt;
  &lt;query&gt;
    &lt;host&gt;        <span class="org-comment-delimiter"># </span><span class="org-comment">e.g. localhost</span>
    &lt;ip&gt;          <span class="org-comment-delimiter"># </span><span class="org-comment">e.g. 127.0.0.1    </span>
    <span class="org-string">"*:*"</span>         <span class="org-comment-delimiter"># </span><span class="org-comment">&#25152;&#26377;&#33410;&#28857;</span>
    <span class="org-string">"role:&lt;role&gt;"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#23646;&#20110; role &#30340;&#33410;&#28857; </span>
  &lt;options&gt;
    -m, --manual-list <span class="org-comment-delimiter"># </span><span class="org-comment">&lt;query&gt; &#26159;&#25163;&#21160;&#30340;&#26381;&#21153;&#22120;&#21517;</span>
    -p, --ssh-port &lt;port&gt;
    -x, --ssh-user &lt;name&gt;
    -i, --ssh-identity-file &lt;path&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd701515" class="outline-3">
<h3 id="orgd701515"><span class="section-number-3">19.9</span> <code>vault</code></h3>
<div class="outline-text-3" id="text-19-9">
<p>
<code>chef-vault</code> 使用公钥加密 data bag item，拥有私钥的节点能够解密。
</p>
</div>
</div>
</div>

<div id="outline-container-org3d0e6cf" class="outline-2">
<h2 id="org3d0e6cf"><span class="section-number-2">20</span> <code>berks</code></h2>
<div class="outline-text-2" id="text-20">
</div><div id="outline-container-org405c53e" class="outline-3">
<h3 id="org405c53e"><span class="section-number-3">20.1</span> <code>install</code></h3>
<div class="outline-text-3" id="text-20-1">
<div class="org-src-container">
<pre class="src src-sh">berks install <span class="org-comment-delimiter"># </span><span class="org-comment">&#23433;&#35013;&#20381;&#36182;&#21040;&#26412;&#22320;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea7c24b" class="outline-3">
<h3 id="orgea7c24b"><span class="section-number-3">20.2</span> <code>upload</code></h3>
<div class="outline-text-3" id="text-20-2">
<p>
上传依赖到 Chef Server。
</p>

<div class="org-src-container">
<pre class="src src-sh">berks upload &lt;options&gt;
  --force <span class="org-comment-delimiter"># </span><span class="org-comment">&#24378;&#21046;&#19978;&#20256;&#65292;&#40664;&#35748;&#21482;&#19978;&#20256;&#29256;&#26412;&#21464;&#21270;&#30340; cookbook</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org91b87d9" class="outline-2">
<h2 id="org91b87d9"><span class="section-number-2">21</span> <code>cookstyle</code></h2>
<div class="outline-text-2" id="text-21">
<p>
检查 recipe 语法和样式，基于 Ruby 静态分析器 <a href="https://github.com/rubocop-hq/rubocop">RuboCop</a> 。
</p>

<div class="org-src-container">
<pre class="src src-sh">cookstyle &lt;options&gt; &lt;file&gt; ...
</pre>
</div>
</div>
</div>

<div id="outline-container-orge778951" class="outline-2">
<h2 id="orge778951"><span class="section-number-2">22</span> 链接</h2>
<div class="outline-text-2" id="text-22">
<ol class="org-ol">
<li><a href="https://docs.chef.io/">Chef Docs</a></li>
<li><a href="http://www.foodcritic.io/">Foodcritic</a></li>
<li><a href="https://kitchen.ci/">Test Kitchen</a></li>
<li><a href="https://www.inspec.io/">InSpec</a></li>
<li><a href="https://supermarket.chef.io/">Chef Supermarket</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Victor Chen</p>
<p class="date">Created: 2019-06-16 Sun 19:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
